{
    "main": {
      "channel": "greenit",
      "text": "Ok alors aujourd'hui, on va attaquer avec un gros sujet",
      "next": "2"
    },
    "2": {
      "channel": "greenit",
      "wait": "2000",
      "text": "En fait, un seul mot peut tout résumer : la PROXIMITE",
      "next": "3"
    },
    "3": {
      "channel": "greenit",
      "wait": "3000",
      "text": "Quand vous concevez un service utilisable à distance (un site web, une API, etc.), un des leviers d'optimisation est d'avoir une proximité géographique entre les utilisateurs et votre serveur.",
      "next": "4"
    },
    "4": {
      "channel": "greenit",
      "wait": "5000",
      "text": "Par exemple, si vous ouvrez un service français, il est pertinent d'avoir un serveur en France.",
      "next": "5"
    },
    "5": {
      "channel": "greenit",
      "wait": "4000",
      "text": "Dans le cas contraire, si on choisissais un serveur en heu... Alaska tiens ! Eh bien les requêtes de nos utilisateurs français auraient à parcourir un sacré chemin avant d'atteindre leur destination et revenir.",
      "next": "6"
    },
    "6": {
      "channel": "greenit",
      "wait": "6000",
      "text": "Eh oui car les requêtes vont passer à travers une infrastructure qui grandit avec le chemin à parcourir. Et à chaque étape de ce chemin, elle va consommer bande passante et ressources matérielles.",
      "next": "7"
    },
    "7": {
      "channel": "greenit",
      "wait": "6000",
      "text": "Je terminerai par un exemple concret : sur AWS, il est possible de choisir les régions dans lesquelles vous voulez implanter vos services. Alors je compte sur vous pour vous rapprochez géographiquement de vos utilisateurs :wink:",
      "next": "8"
    },
    "8": {
      "channel": "greenit",
      "wait": "6000",
      "text": "C'est tout pour aujourd'hui. A demain !",
      "next": "9"
    },
    "9": {
      "channel": "greenit",
      "wait": "4000",
      "text": "Oh j'oubliai : si vous souhaitez échanger là-dessus (ou sur tout autre sujet d'écoconception), the floor is yours ! Eh ouaip, je suis bilingue ! :flag-us:"
    }
  }